app/Http/Controllers/ExpenseController.php

    public function index()
    {
        $expenses = Expense::all();
---
select * from `expenses`